Revit 2024 API
BuiltInFailures.RebarShapeFailures.MultiPlanarDepth Property
 Multi-planar depth of Rebar Shape can't be too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MultiPlanarDepth { get; }
Visual Basic
Public Shared ReadOnly Property MultiPlanarDepth As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MultiPlanarDepth {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace